<b><font size="6">01. Data Preprocessing</font><a class="anchor"><a id='toc'></a></b><br><br>
This notebook requires previous knowledge in Pandas library. Feel free to complement your knowledge with online tutorials such as:<br>
https://learn.datacamp.com/courses/data-manipulation-with-pandas <br>

# <font color='#BFD72F'>1. Importing Data</font> <a class="anchor" id="first-bullet"></a>

In [1]:
# connect to local repository
from os import getcwd

path = getcwd()

**Step 1** - Import the pandas library and define the alias as 'pd'

In [2]:
# Import pandas
import pandas as pd

In [20]:
#pip install openpyxl

**Step 2** - Read the excel file 'tugas.xlsx' and save it to the object `data` using the pandas method `pd.read_excel()`

In [3]:
# Import the dataset
tugas = pd.read_excel( 'data/tugas.xlsx', engine='openpyxl')

<a class="anchor" id="data">
    
## 1.1. The data available: Customer information

</a>

- **Customer ID**

##### Sociodemographic data:
- **Gender**
- **Age** 
- **Education**
- **Marital Status**
- **Dependents**
- **Income**

##### Firmographic data:
- **RFM**
- **Product purchase history (Clothes / House Keeping / Kitchen / Small Appliances / Toys)**
- **Channel usage**
- **Recommendation**

# <font color='#BFD72F'>2. Data Preparation</font> <a class="anchor" id="second-bullet"></a>


* [2.1 - Data Preparation](#preparation)
* [2.2 - Data Cleaning](#cleaning)
* [2.3 - Feature Engineering](#transformation)
* [2.4 - Scaling Data](#normalize)
* [2.5 - Correlations](#corr)

<a class="anchor" id="preparation">

## 2.1.  Data Preparation

</a>

[Back to Data Preparation](#second-bullet) <br><br>
In this phase, we are going to view some useful commands to prepare the dataset to suffer preprocessing tasks.

We are going to learn how to:
- Make copies of the original dataset; <br>
- Drop columns; <br>
- Rename columns; <br>
- Set the index; <br>
- Convert data types; <br>

### 2.1.1. Duplicated Data

Do we have duplicated rows? We can check that using the pandas method `duplicated()`. When using this method there are some parameters we can provide to it. We can use `subset` to only check for duplicates within a specific subset of columns. We can set the `keep` parameter to 'first', 'last' or False. Setting the `keep` parameter to 'first' will signal all duplicates as True except for their first occurrence. Similarly, setting `keep` to 'last' will signal all duplicate records as True except for their last occurrence. If we want to see all duplicate records we should set `keep` to False.

In [5]:
#  Step 3
tugas[tugas.duplicated(keep=False)]

,Unnamed: 0,Custid,Year_Birth,Gender,Education,Marital_Status,Dependents,Income,Dt_Customer,Rcn,Frq,Mnt,Clothes,Kitchen,SmallAppliances,HouseKeeping,Toys,NetPurchase,CatPurchase,Recomendation
24,24,1677,1941,F,Graduation,Married,0,99323.7,2014-01-09,71,26,1134.64,42,20,27,2,9,16,84,5
25,24,1677,1941,F,Graduation,Married,0,99323.7,2014-01-09,71,26,1134.64,42,20,27,2,9,16,84,5

It seems that we have two rows that are duplicated. <br>

**Step 4 -** To drop the duplicate row(s), we can use the `drop_duplicates()` method. <br>
Most methods in pandas do not apply the changes directly to the object. In this way, and in this case, we need to define the parameter inplace as `inplace = True` so the changes are applied directly on the dataset. <br>
Once again, `drop_duplicates` also has a `keep` parameter. The default value for this parameter is 'first', meaning it will keep first occurrences of duplicate rows in the dataset.

In [6]:
# Step 4
tugas.drop_duplicates(inplace = True)

Now the data is clean from duplicate rows.

In [7]:
tugas[tugas.duplicated(keep=False)]

Empty DataFrame
Columns: [Unnamed: 0, Custid, Year_Birth, Gender, Education, Marital_Status, Dependents, Income, Dt_Customer, Rcn, Frq, Mnt, Clothes, Kitchen, SmallAppliances, HouseKeeping, Toys, NetPurchase, CatPurchase, Recomendation]
Index: []

### 2.1.2. Make a copy from the original dataset

*   List item
*   List item

In some cases, as a way to not affect our original dataset, or to create a new dataset using a subset of the original dataset, we should use the `copy()` method.

**Step 5** -  Using the pandas method `copy()`, create a new dataset named `tugas2` with the variables ['Custid','Year_Birth','Gender']:

In [8]:
tugas2 = tugas[['Custid','Year_Birth','Gender']].copy()
tugas2.head()

   Custid  Year_Birth Gender
0    1041        1997      F
1    1061        1947      F
2    1076        1986      F
3    1091        1969      F
4    1094        1964      M

When using `copy` keep in mind it accepts a parameter called `deep`. If set to True(the default value), a copy of the original dataset is created sso that modifications to the data or indices of the copy will not be reflected in the original object. However, if this parameter is set to False, only referencess to the data will be copied, which meaens that any changes to the data of the original will be reflected in the copy (and vice versa)

### 2.1.3. Drop a column

If we want to drop a column from our dataset, we can use the method `drop()`.

In [9]:
# Step 6
tugas2.drop(labels = ['Custid'], axis = 1, inplace=True)
tugas2.head()

   Year_Birth Gender
0        1997      F
1        1947      F
2        1986      F
3        1969      F
4        1964      M

The parameter `axis` accepts either the value  0 or 1, meaning whether to drop labels from the index (0 or 'index') or columns (1 or `columns`). Dropping labels from the index is the same as dropping rows.

### 2.1.4. To rename colunms

As a way to make the dataset more perceptible, sometimes we may need to change the columns names.

In [10]:
tugas2 = tugas[['Custid','Year_Birth','Gender']].copy()

**Step 7** - Rename the columns directly by assoiating a list of new names of columns to the attribute `columns` of the dataset `tugas`

In [12]:
tugas2.columns

Index(['Custid', 'Year_Birth', 'Gender'], dtype='object')

In [14]:
tugas2.columns = ['NumberCust', 'Year', 'Male_Fem']
tugas2.head()

   NumberCust  Year Male_Fem
0        1041  1997        F
1        1061  1947        F
2        1076  1986        F
3        1091  1969        F
4        1094  1964        M

If we want to rename only some columns, passing a list with names for all columns can be exhaustive. In these cases we can use the method `rename()`.

In [15]:
tugas2.rename(columns={"NumberCust": "Custid", "Male_Fem": "Gen"}, inplace=True)
tugas2.head()

### 2.1.5. To set index

In [18]:
tugas2 = tugas[['Custid','Year_Birth','Gender']].copy()

if we want to define the index of our dataset as being specific column that we have , we can use the method set_index()

**Step 8** - Redefine the index of tugas2 by calling the method set_index and fill the parameters as follows:
-   Keys='CustId'
-   inplace=True

In [19]:
# Step 8
tugas2.set_index('Custid', inplace=True)
tugas2.head()

        Year_Birth Gender
Custid
1041          1997      F
1061          1947      F
1076          1986      F
1091          1969      F
1094          1964      M

### 2.1.6. Convert Data Types

In some situations, converting a variable to a different data type can be handy.
Strings are called float

**Step 9** - Check the type of the variable `Year_Birth` using the attribute `dtype`

In [22]:
# Step 9
tugas2['Year_Birth'].dtype

dtype('int64')

It seems that Year_Birth is an integer value (with 64 bits). Lets change it to an integar value of 32 bits

**Step 10** -  Define the datatype of `Year_Birth` from the dataset `tugas2` as `int32` recurring to the method `astype()`. Confirm the new datatype using the method `dtype`

In [24]:
# Step 10
tugas2['Year_Birth'] = tugas2['Year_Birth'].astype('int32')
tugas2['Year_Birth'].dtype

dtype('int32')

<a class="anchor" id="cleaning">

## 2.2.  Data Cleaning

</a>

[Back to Data Preparation](#second-bullet) <br><br>

- Replace values; <br>
- Check missing values; <br>
- Filter out missing values; <br>
- Drop rows; <br>
- Fill in missing values; <br>
- Detect and remove outliers; <br>